In [1]:
import numpy as np
import pandas as pd

In [3]:
arr=np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])

In [4]:
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [6]:
df=pd.DataFrame(arr,index=["Index1","Index2","Index3"],
               columns=["Column1","Column2","Column3"])

In [7]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [8]:
df.dropna() # axis=0 da nan içeren indexleri siler

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [12]:
df.dropna(axis=1)

        Column1
Index1     10.0
Index2      5.0
Index3     21.0

In [11]:
df.dropna(thresh=2)  # eğer bir indexte 2 tane nan değer yoksa silmez!

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     21.0      NaN     10.0

In [38]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [17]:
df.fillna(value=df.mean().mean())

        Column1  Column2  Column3
Index1     10.0     20.0     14.0
Index2      5.0     14.0     14.0
Index3     21.0     14.0     10.0

In [20]:
df.sum().sum()

66.0

In [21]:
df.size # veri sayımız

9

In [24]:
df.isnull().sum().sum() # verilerimizdeki nan sayısı

4

In [34]:
def calculateMean(data):  # ortalamayı hesaplayan fonksiyon
    totalSum=data.sum().sum()
    totalNum=data.size-data.isnull().sum().sum()
    return totalSum/totalNum

In [37]:
df.fillna(value= calculateMean(df)) # nan değerlerimiz yerine ortalama değerleri yazdırdık

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0

# GroupBy

In [8]:
import numpy as np
import pandas as pd

In [18]:
dataset={
    "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
    "Maaş":[3000,3500,2500,4500,4000,2000],
    "Çalışan": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
    
}

In [19]:
df=pd.DataFrame(dataset)

In [20]:
df

          Departman  Maaş  Çalışan
0           Bilişim  3000  Mustafa
1  İnsan Kaynakları  3500     Jale
2            Üretim  2500    Kadir
3            Üretim  4500   Zeynep
4           Bilişim  4000    Murat
5  İnsan Kaynakları  2000    Ahmet

In [21]:
depGroup=df.groupby("Departman")

In [22]:
depGroup

In [23]:
depGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [24]:
df.groupby("Departman").sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [27]:
df.groupby("Departman").sum().loc["Bilişim"]

Maaş    7000
Name: Bilişim, dtype: int64

In [ ]:
# yukarıdaki örnekte sadece 7000 i almak istersek tür dönüşümü yapmamız gerekir

In [30]:
int(df.groupby("Departman").sum().loc["Bilişim"])

7000

In [31]:
df.groupby("Departman").count()

                  Maaş  Çalışan
Departman
Bilişim              2        2
Üretim               2        2
İnsan Kaynakları     2        2

In [33]:
df.groupby("Departman").max()

                  Maaş  Çalışan
Departman
Bilişim           4000  Mustafa
Üretim            4500   Zeynep
İnsan Kaynakları  3500     Jale

In [34]:
df.groupby("Departman").min()

                  Maaş Çalışan
Departman
Bilişim           3000   Murat
Üretim            2500   Kadir
İnsan Kaynakları  2000   Ahmet

In [44]:
df.groupby("Departman").min()["Maaş"]

Departman
Bilişim             3000
Üretim              2500
İnsan Kaynakları    2000
Name: Maaş, dtype: int64

In [45]:
df.groupby("Departman").min()["Maaş"]["Bilişim"]

3000

In [46]:
df.groupby("Departman").mean()

                  Maaş
Departman
Bilişim           3500
Üretim            3500
İnsan Kaynakları  2750